# SVM Support vector machine

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')

In [3]:
from sklearn.preprocessing import LabelEncoder
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn import svm

In [4]:
le = LabelEncoder()

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df['Embarked'] = le.fit_transform(df['Embarked'])

In [7]:
df['Sex'] = le.fit_transform(df['Sex'])

In [27]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,0

In [28]:
# X = df.drop(['Pclass','PassengerId','Name','Ticket','Cabin'],axis=1)

In [29]:
X.head()

   Survived  Sex   Age  SibSp  Parch     Fare  Embarked
0         0    1  22.0      1      0   7.2500         2
1         1    0  38.0      1      0  71.2833         0
2         1    0  26.0      0      0   7.9250         2
3         1    0  35.0      1      0  53.1000         2
4         0    1  35.0      0      0   8.0500         2

In [30]:
from sklearn.model_selection import train_test_split

In [31]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.3,random_state=0)

In [32]:
X_train.head()

     Survived  Sex   Age  SibSp  Parch     Fare  Embarked
350         0    1  45.0      0      0  35.0000         2
124         1    1  12.0      1      0  11.2417         0
577         0    0  45.0      1      0  14.4583         0
422         0    0  28.0      1      1  14.4000         2
118         0    0   2.0      4      2  31.2750         2

In [33]:
X_test.head()

     Survived  Sex   Age  SibSp  Parch      Fare  Embarked
14          0    0  14.0      0      0    7.8542         2
158         0    1  45.0      8      2   69.5500         2
762         1    0  36.0      1      2  120.0000         2
740         0    1  36.0      1      0   78.8500         2
482         1    0  63.0      0      0    9.5875         2

In [36]:

# clf = svm.SVC(gamma=0.01,C=100)

In [37]:
# clf.fit(X_train,y_train)

In [38]:
# y_pred = clf.predict(X_test)

In [39]:
# y_pred

In [40]:
# accuracy_score(y_test,y_pred,normalize=True)

In [41]:
# confusion_matrix(y_test,y_pred)

In [42]:
# X.head()

In [48]:
df = df.drop(['PassengerId','Name','Ticket','Cabin'],axis=1)

In [49]:
features = ['Survived','Sex','SibSp','Parch','Embarked','Pclass']

In [50]:
def clf(df,features):
    for i in features:
        y = df[features];
        X = df.drop(columns=[features])
        X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.3,random_state=0)        
        clf = svm.SVC(gamma=0.01,C=100)
        clf.fit(X_train,y_train)
        y_pred = clf.predict(X_test)
        a = accuracy_score(y_test,y_pred,normalize=True)
        c = confusion_matrix(y_test,y_pred)
        return a,c,features

In [51]:
result =[]
for dependent in features:
    result.append(clf(df,dependent))

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  889 non-null    int64
 1   Pclass    889 non-null    int64
 2   Sex       889 non-null    int32
 3   Age       889 non-null    float64
 4   SibSp     889 non-null    int64
 5   Parch     889 non-null    int64
 6   Fare      889 non-null    float64
 7   Embarked  889 non-null    int32
dtypes: float64(2), int32(2), int64(4)
memory usage: 48.7 KB

In [54]:
for i in result:
    a,b,c = i
    print(a)
    print(b)    
    print(c)    
    print('\n')

0.7415730337078652
[[124  33]
 [ 36  74]]
Survived


0.7265917602996255
[[ 66  32]
 [ 41 128]]
Sex


0.7490636704119851
[[150  24   7   0   1   0   0]
 [ 21  39   5   0   0   0   0]
 [  4   1   3   0   0   0   0]
 [  0   2   1   3   1   0   0]
 [  0   0   0   0   2   0   0]
 [  0   0   0   0   0   1   0]
 [  0   0   0   0   0   0   2]]
SibSp


0.797752808988764
[[187   6   5   0   0   0]
 [ 21  15   3   0   0   1]
 [ 10   6  11   0   0   0]
 [  0   0   1   0   0   0]
 [  1   0   0   0   0   0]
 [  0   0   0   0   0   0]]
Parch


0.7677902621722846
[[ 23   2  24]
 [  0   8  14]
 [ 18   4 174]]
Embarked


0.9026217228464419
[[ 64   4   2]
 [  4  36   9]
 [  1   6 141]]
Pclass

# Best accuracy is given by
* dv = ['Pclass']

* idv = ['Survived','Sex','SibSp','Parch','Embarked']